{"sections":{"main":{"type":"page","disabled":true,"settings":{}},"section_faq_JHP4dp":{"type":"section-faq","blocks":{"item_eVpWNy":{"type":"item","settings":{"title":"","que":"What is Skillmatics?","ans":"<p>Skillmatics is a global brand that develops innovative educational products and games that build core skills in children through the joy of play! Our mission is to offer families a smarter way to play and enable each child to realise their full potential - one Skillmatics product at a time!<\/p>"}},"item_cM6Xxk":{"type":"item","settings":{"title":"","que":"What products do we offer?","ans":"<p>Skillmatics has a wide portfolio of over 200+ award winning products across 4 key categories - Learning & Education, Board & Card Games, STEM Building Toys and Preschool. We are growing our portfolio rapidly, so keep an eye out for new categories and products!<\/p>"}},"item_yjLxYz":{"type":"item","settings":{"title":"","que":"How do we develop our products?","ans":"<p>At Skillmatics, we have a 100 member product team consisting of subject experts, educationalists, remedial instructors and design specialists who collaborate to create our innovative products. All our products are designed based on our unique learning framework which has been inspired by Kolb’s Learning Cycle and Harvard Gardner’s Theory of Multiple Intelligences.<\/p>"}},"item_xPUF3K":{"type":"item","settings":{"title":"Product Safety:","que":"Are Skillmatics products safe for my children?","ans":"<p>Yes. Every Skillmatics product is 100% safe and non-toxic. All our products are in full compliance with American (ASTM), European (EN-71) and Indian (BIS) Safety Standards.<\/p>"}},"item_RQTiEX":{"type":"item","settings":{"title":"","que":"What materials are used in the products?","ans":"<p>Skillmatics is a new age brand that cares about the world our children will grow up in. We believe in using sustainable materials which is why our products are predominantly paper and wood based.<\/p>"}},"item_zk43c4":{"type":"item","disabled":true,"settings":{"title":"Product Specific FAQs (Write & Wipe):","que":"How long will the Skilly Billy marker last?","ans":"<p>As with any writing instrument, this depends on the frequency of use. When not in use, markers that are stored horizontally with caps installed tightly can last for 1 year.<\/p>"}},"item_WWKqcP":{"type":"item","disabled":true,"settings":{"title":"","que":"How can I remove a stain caused by my Skilly Billy marker?","ans":"<p>Stains on the activity mats can be removed with soap and water. Stains on fabrics are harder to remove. We suggest using regular detergent or baking soda.<\/p>"}},"item_3wHbgB":{"type":"item","disabled":true,"settings":{"title":"","que":"","ans":""}},"item_RQmpH8":{"type":"item","disabled":true,"settings":{"title":"","que":"Can I use a regular dry erase \/ whiteboard marker on the Skillmatics Write and Wipe Activity Mats?","ans":"<p>Yes, any regular dry erase \/ whiteboard marker will also work!<\/p>"}},"item_7x3MR4":{"type":"item","disabled":true,"settings":{"title":"","que":"Can the Skilly Billy marker be restored if it dries out?","ans":"<p>The markers can often be restored if there isn’t too much solvent loss. Place the cap back on the marker tightly and store it (tip down) for 24 hours. Once revived, store the marker in its normal horizontal position.<\/p>"}},"item_neri7D":{"type":"item","disabled":true,"settings":{"title":"","que":"Can I just buy the Skilly Billy Markers?","ans":"<p>Unfortunately, we do not sell the Skilly Billy pens by themselves. You can, however, use any white board marker on the sheets.<\/p>"}},"item_RBCUn4":{"type":"item","disabled":true,"settings":{"title":"Product Specific FAQs (Buildables):","que":"Are Buildables products safe for children?","ans":"<p>Safety is our first priority, and we assure you our products are safe for children. All Buildables products are tested, and subsequently certified by testing labs.<\/p>"}},"item_PwJt3E":{"type":"item","disabled":true,"settings":{"title":"","que":"Where can I get some further guidance on how to build the product?","ans":"<p>Every box comes with a detailed, step-by-step instruction manual, which we recommend you follow carefully. You must also track your progress at all the 'checkpoints', to make sure you are progressing correctly. You can also watch a free instructional video by scanning the QR code on the front of the box or on the Build Manual. If you have any further questions, feel free to contact us at help@skillmatics.in, we will be happy to help you!<\/p>"}},"item_W3N7Yk":{"type":"item","disabled":true,"settings":{"title":"","que":"What if parts are missing\/broken\/wrong in my products?","ans":"<p>We have included extra essential parts in every product to ensure you do not face any problem in building your machine. If you have any further questions or queries, feel free to contact us at help@skillmatics.in, we will be happy to help you!<\/p>"}},"item_3aMecJ":{"type":"item","disabled":true,"settings":{"title":"","que":"What age is Buildables for? Can children below the specified age group use the product?","ans":"<p>Buildables is designed for ages 8-15 years. However, we believe that with guidance, even children below our proposed age group can build and use Buildables products.<\/p>"}},"item_ktKMfr":{"type":"item","disabled":true,"settings":{"title":"","que":"Do I need any additional tools to build the product?","ans":"<p>All the tools you need are provided in the Buildables box.<\/p>"}},"item_jaYdXK":{"type":"item","disabled":true,"settings":{"title":"","que":"Will the Buildables machine work as well as a factory-made machine?","ans":"<p>The Buildables range focuses on providing the experience of building a machine from scratch and teaching practical STEM skills. The product is a 'model' built by a child, with non-motorized technology. Therefore, it can only partially replicate a factory-machine to a certain level of performative accuracy.<\/p>"}},"item_3DDwUy":{"type":"item","settings":{"title":"Payment:","que":"What payment methods do you accept?","ans":"<p>We accept all valid debit cards, credit cards, payment wallets, and net banking.<\/p>"}},"item_TjBBiC":{"type":"item","settings":{"title":"","que":"Do you offer cash on delivery?","ans":"<p>Yes, we offer cash on delivery at a nominal charge of Rs 50 for all orders up to Rs 5,000<\/p>"}},"item_p7rTPA":{"type":"item","settings":{"title":"Shipping & Delivery:","que":"How long will my order take to be delivered to me?","ans":"<p>All orders are delivered within 3-5 working days across India.<\/p>"}},"item_y6AYyh":{"type":"item","settings":{"title":"","que":"Where can I track my shipment?","ans":"<p>You will first receive an email confirming your order once it has been placed. Once your order has been dispatched, you will receive an email with the details of the tracking number and the courier company that is processing your order. You can track the status of your package 24 hours after your order is dispatched from our warehouse or you can email us at help@skillmatics.in and we’ll do it for you. You can expect a response from us within a day with your updated shipping status.<\/p>"}},"item_Veqwjh":{"type":"item","settings":{"title":"","que":"Who are our trusted courier partners?","ans":"<p>Blue Dart – http:\/\/www.bluedart.com\/<br\/>Vamaship – https:\/\/ecom.vamaship.com\/track\/<br\/>The Professional Couriers – http:\/\/www.tpcindia.com\/<\/p>"}},"item_nzR7aG":{"type":"item","settings":{"title":"","que":"How much am I paying for shipping?","ans":"<p>We offer free shipping on orders over Rs 400. For orders under Rs 400, a Rs 40 shipping fee is applicable.<\/p>"}},"item_KdRg6C":{"type":"item","settings":{"title":"","que":"Does Skillmatics ship internationally?","ans":"<p>Yes! Please contact us at help@skillmatics.in to place an order for international shipping.<\/p>"}},"item_rtgC8W":{"type":"item","settings":{"title":"Returns & Exchanges:","que":"How do I return a product?","ans":"<p>To return an item back to Skillmatics please:<br\/><\/p><ul><li>Email us at help@skillmatics.in with the name of the product you are returning, your order number and the reason for your return.<\/li><li>We will generate a pick up from your address with our trusted delivery partner.<\/li><li>We will refund your account once your return has been delivered to our warehouse. Refunds can take up to 10 business days to reflect on your credit card account.<\/li><\/ul>"}},"item_NpnFTC":{"type":"item","settings":{"title":"","que":"What is our return policy?","ans":"<ul><li>We offer hassle-free returns within 30 days of purchase. To initiate a return, just email us at help@skillmatics.in with your order number, and we will arrange for the product to be picked up from your location.<\/li><li>If you receive an incorrect, incomplete, defective, or damaged product, we’d be happy to replace it at no additional cost.<\/li><li>If you wish to return the product due to a change of mind or personal preference, we kindly request that the shrink wrap remains unopened, as it is necessary to process the return.<\/li><\/ul>"}},"item_7TewME":{"type":"item","settings":{"title":"","que":"How do I exchange a product?","ans":"<p>We entertain exchanges only if there are items missing from the box. If you wish to exchange your product, please send us an email at help@skillmatics.in<\/p>"}},"item_BJ86Wp":{"type":"item","settings":{"title":"","que":"How can I cancel an order that is placed?","ans":"<p>You can cancel your order at any time. Simply email us at help@skillmatics.in with your order number and we will cancel the order.<\/p>"}},"item_98hhRf":{"type":"item","settings":{"title":"","que":"Bulk Discounts and Return Gifting","ans":"<p>Hosting a birthday party? Reach out to us at help@skillmatics.in for bulk discounts and special offers.<\/p>"}},"item_kNq8tG":{"type":"item","settings":{"title":"","que":"How long does it take for a product to get restocked?","ans":"<p>We try our best to keep pace with the rapidly growing demand for Skillmatics. However, there are times when a few of our products can get out of stock. You can typically expect “out of stock” items to be back in stock within 7 days.<\/p>"}}},"block_order":["item_eVpWNy","item_cM6Xxk","item_yjLxYz","item_xPUF3K","item_RQTiEX","item_zk43c4","item_WWKqcP","item_3wHbgB","item_RQmpH8","item_7x3MR4","item_neri7D","item_RBCUn4","item_PwJt3E","item_W3N7Yk","item_3aMecJ","item_ktKMfr","item_jaYdXK","item_3DDwUy","item_TjBBiC","item_p7rTPA","item_y6AYyh","item_Veqwjh","item_nzR7aG","item_KdRg6C","item_rtgC8W","item_NpnFTC","item_7TewME","item_BJ86Wp","item_98hhRf","item_kNq8tG"],"settings":{"text1":"Frequently asked questions","text2":"","sectionbg":"#ffffff"}}},"order":["main","section_faq_JHP4dp"]}